[Killed] BlockStatement
main/components/Nav/GithubLogin.js:4:66
 import { Button, Navbar } from "react-bootstrap";
 import { Link } from "react-router-dom";
 
-export default function GithubLogin({ currentUser, systemInfo }) {
-  var githubOauthLogin =
-    systemInfo?.githubOauthLogin || "/oauth2/authorization/github";
-  if (!currentUser || !currentUser.loggedIn) {
-    return <span data-testid="GithubLogin-logged-out" />;
-  }
-  if (currentUser.root.user.githubLogin) {
-    return (
-      <>
-        <Navbar.Text className="me-3" as={Link} to="/profile">
-          Github: {currentUser.root.user.githubLogin}
-        </Navbar.Text>
-      </>
-    );
-  }
-  return (
-    <>
-      <Button href={githubOauthLogin}>Connect Github</Button>
-    </>
-  );
-}
+export default function GithubLogin({ currentUser, systemInfo }) {}
 
killedBy: GithubLogin tests renders correctly when not logged in to Google
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="GithubLogin-logged-out"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] OptionalChaining
main/components/Nav/GithubLogin.js:6:5
 
 export default function GithubLogin({ currentUser, systemInfo }) {
   var githubOauthLogin =
-    systemInfo?.githubOauthLogin || "/oauth2/authorization/github";
+    systemInfo.githubOauthLogin || "/oauth2/authorization/github";
   if (!currentUser || !currentUser.loggedIn) {
     return <span data-testid="GithubLogin-logged-out" />;
killedBy: AppNavbar tests renders correctly for regular logged in user
statusReason: TypeError: Cannot read properties of undefined (reading 'githubOauthLogin')

[Killed] ConditionalExpression
main/components/Nav/GithubLogin.js:6:5
 
 export default function GithubLogin({ currentUser, systemInfo }) {
   var githubOauthLogin =
-    systemInfo?.githubOauthLogin || "/oauth2/authorization/github";
+    true;
   if (!currentUser || !currentUser.loggedIn) {
     return <span data-testid="GithubLogin-logged-out" />;
killedBy: GithubLogin tests default link is the correct value
statusReason: Error: expect(element).toHaveAttribute("href", "/oauth2/authorization/github") // element.getAttribute("href") === "/oauth2/authorization/github"

Expected the element to have attribute:
  href="/oauth2/authorization/github"
Received:
  null

[Killed] BooleanLiteral
main/components/Nav/GithubLogin.js:7:7
 export default function GithubLogin({ currentUser, systemInfo }) {
   var githubOauthLogin =
     systemInfo?.githubOauthLogin || "/oauth2/authorization/github";
-  if (!currentUser || !currentUser.loggedIn) {
+  if (currentUser || !currentUser.loggedIn) {
     return <span data-testid="GithubLogin-logged-out" />;
   }
killedBy: GithubLogin tests default link is the correct value
statusReason: Error: Unable to find an element with the text: Connect Github. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <span
      data-testid="GithubLogin-logged-out"
    />

[Killed] BooleanLiteral
main/components/Nav/GithubLogin.js:7:23
 export default function GithubLogin({ currentUser, systemInfo }) {
   var githubOauthLogin =
     systemInfo?.githubOauthLogin || "/oauth2/authorization/github";
-  if (!currentUser || !currentUser.loggedIn) {
+  if (!currentUser || currentUser.loggedIn) {
     return <span data-testid="GithubLogin-logged-out" />;
   }
killedBy: GithubLogin tests renders correctly when not logged in to Google
statusReason: TypeError: Cannot read properties of undefined (reading 'user')

[Killed] ConditionalExpression
main/components/Nav/GithubLogin.js:10:7
   if (!currentUser || !currentUser.loggedIn) {
     return <span data-testid="GithubLogin-logged-out" />;
   }
-  if (currentUser.root.user.githubLogin) {
+  if (true) {
     return (
       <>
killedBy: GithubLogin tests default link is the correct value
statusReason: Error: Unable to find an element with the text: Connect Github. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <a
      class="me-3 navbar-text"
      href="/profile"

[Killed] BlockStatement
main/components/Nav/GithubLogin.js:10:42
   if (!currentUser || !currentUser.loggedIn) {
     return <span data-testid="GithubLogin-logged-out" />;
   }
-  if (currentUser.root.user.githubLogin) {
-    return (
-      <>
-        <Navbar.Text className="me-3" as={Link} to="/profile">
-          Github: {currentUser.root.user.githubLogin}
-        </Navbar.Text>
-      </>
-    );
-  }
+  if (currentUser.root.user.githubLogin) {}
   return (
     <>
killedBy: GithubLogin tests renders correctly for user logged into Google and Github
statusReason: Error: Unable to find an element with the text: Github: cgaucho-github. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <a
      class="btn btn-primary"
      href="/oauth2/authorization/github"
