[Killed] StringLiteral
main/components/Users/RoleEmailForm.js:24:24
 
   const navigate = useNavigate();
 
-  const testIdPrefix = "RoleEmailForm";
+  const testIdPrefix = "";
 
   return (
killedBy: RoleEmailForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="RoleEmailForm-email"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
