[Killed] BlockStatement
main/components/Nav/GoogleLogin.js:4:76
 import { Button, Navbar } from "react-bootstrap";
 import { Link } from "react-router-dom";
 
-export default function GoogleLogin({ currentUser, systemInfo, doLogout }) {
-  var oauthLogin = systemInfo?.oauthLogin || "/oauth2/authorization/google";
-  return (
-    <>
-      {currentUser && currentUser.loggedIn ? (
-        <>
-          <Navbar.Text className="me-3" as={Link} to="/profile">
-            Welcome, {currentUser.root.user.email}
-          </Navbar.Text>
-          <Button onClick={doLogout}>Log Out</Button>
-        </>
-      ) : (
-        <Button href={oauthLogin}>Log In</Button>
-      )}
-    </>
-  );
-}
+export default function GoogleLogin({ currentUser, systemInfo, doLogout }) {}
 
killedBy: AppNavbar tests renders correctly for regular logged in user
statusReason: Error: Unable to find an element with the text: Welcome, pconrad.cis@gmail.com. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="App

[Killed] ConditionalExpression
main/components/Nav/GoogleLogin.js:5:20
 import { Link } from "react-router-dom";
 
 export default function GoogleLogin({ currentUser, systemInfo, doLogout }) {
-  var oauthLogin = systemInfo?.oauthLogin || "/oauth2/authorization/google";
+  var oauthLogin = true;
   return (
     <>
killedBy: AppNavbar tests when oauthlogin undefined, default value is used
statusReason: Error: expect(element).toHaveAttribute("href", "/oauth2/authorization/google") // element.getAttribute("href") === "/oauth2/authorization/google"

Expected the element to have attribute:
  href="/oauth2/authorization/google"
Received:
  null

[Killed] LogicalOperator
main/components/Nav/GoogleLogin.js:5:20
 import { Link } from "react-router-dom";
 
 export default function GoogleLogin({ currentUser, systemInfo, doLogout }) {
-  var oauthLogin = systemInfo?.oauthLogin || "/oauth2/authorization/google";
+  var oauthLogin = systemInfo?.oauthLogin && "/oauth2/authorization/google";
   return (
     <>
killedBy: AppNavbar tests when oauthlogin undefined, default value is used
statusReason: Error: expect(element).toHaveAttribute("href", "/oauth2/authorization/google") // element.getAttribute("href") === "/oauth2/authorization/google"

Expected the element to have attribute:
  href="/oauth2/authorization/google"
Received:
  null

[Killed] ConditionalExpression
main/components/Nav/GoogleLogin.js:8:8
   var oauthLogin = systemInfo?.oauthLogin || "/oauth2/authorization/google";
   return (
     <>
-      {currentUser && currentUser.loggedIn ? (
+      {false ? (
         <>
           <Navbar.Text className="me-3" as={Link} to="/profile">
killedBy: AppNavbar tests renders correctly for regular logged in user
statusReason: Error: Unable to find an element with the text: Welcome, pconrad.cis@gmail.com. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="App

[Killed] ConditionalExpression
main/components/Nav/GoogleLogin.js:8:8
   var oauthLogin = systemInfo?.oauthLogin || "/oauth2/authorization/google";
   return (
     <>
-      {currentUser && currentUser.loggedIn ? (
+      {true ? (
         <>
           <Navbar.Text className="me-3" as={Link} to="/profile">
killedBy: AppNavbar tests when oauthlogin undefined, default value is used
statusReason: TypeError: Cannot read properties of undefined (reading 'email')
