[Survived] StringLiteral
main/components/Users/RoleEmailTable.js:19:6
   const deleteMutation = useBackendMutation(
     cellToAxiosParamsDelete,
     { onSuccess: onDeleteSuccess },
-    ["/api/users/all"],
+    [""],
   );
 

[Survived] ArrayDeclaration
main/components/Users/RoleEmailTable.js:19:5
   const deleteMutation = useBackendMutation(
     cellToAxiosParamsDelete,
     { onSuccess: onDeleteSuccess },
-    ["/api/users/all"],
+    [],
   );
 

[Killed] ArrayDeclaration
main/components/Users/RoleEmailTable.js:27:19
     deleteMutation.mutate(cell);
   };
 
-  const columns = [
-    {
-      Header: "Email",
-      accessor: "email",
-    },
-  ];
+  const columns = [];
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: RoleEmailTable tests renders without crashing for three users
statusReason: TestingLibraryElementError: Unable to find an element with the text: Email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Users/RoleEmailTable.js:39:59
       ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
     );
   }
-  return <OurTable data={users} columns={columns} testid={"RoleEmailTable"} />;
+  return <OurTable data={users} columns={columns} testid={""} />;
 }
 
killedBy: RoleEmailTable tests renders without crashing for three users
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RoleEmailTable-cell-row-0-col-email"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
