[Killed] BlockStatement
src/main/utils/RoleEmailUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/users",
-    method: "DELETE",
-    params: {
-      id: cell.row.values.email,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: RoleEmailTable tests Delete button calls delete callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
src/main/utils/RoleEmailUtils.js:10:10
 
 export function cellToAxiosParamsDelete(cell) {
   return {
-    url: "/api/users",
+    url: "",
     method: "DELETE",
     params: {
killedBy: RoleEmailTable tests Delete button calls delete callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/api/users"
Received: ""
