[Killed] ObjectLiteral
main/pages/RosterStudents/RosterStudentsIndexPage.js:21:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/rosterStudents/all", { courseId }],
-    {
-      method: "GET",
-      url: "/api/rosterstudents/course",
-      params: { courseId: courseId },
-    },
+    {},
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: RosterStudentsIndexPage tests renders three rosterStudents correctly for admin user
statusReason: Error: Unable to find an element by: [data-testid="RosterStudentsTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/RosterStudents/RosterStudentsIndexPage.js:30:30
     [],
   );
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="roster_students/new"
-          style={{ float: "right" }}
-        >
-          Create Roster Student
-        </Button>
-      );
-    }
-  };
+  const createButton = () => {};
 
   return (
killedBy: RosterStudentsIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Roster Student/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/RosterStudents/RosterStudentsIndexPage.js:31:45
   );
 
   const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="roster_students/new"
-          style={{ float: "right" }}
-        >
-          Create Roster Student
-        </Button>
-      );
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN")) {}
   };
 
killedBy: RosterStudentsIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Roster Student/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/RosterStudents/RosterStudentsIndexPage.js:36:18
         <Button
           variant="primary"
           href="roster_students/new"
-          style={{ float: "right" }}
+          style={{}}
         >
           Create Roster Student
killedBy: RosterStudentsIndexPage tests Renders with Create Button for admin user
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null

[Killed] BooleanLiteral
main/pages/RosterStudents/RosterStudentsIndexPage.js:51:24
         <h1>Roster Students</h1>
         <RosterStudentsTable
           rosterStudents={rosterStudents}
-          showButtons={true}
+          showButtons={false}
         />
       </div>
killedBy: RosterStudentsIndexPage tests renders three rosterStudents correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RosterStudentsTable-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
