[Killed] ArrayDeclaration
main/components/RosterStudents/RosterStudentsTable.js:72:25
     deleteMutation.mutate(cell);
   };
 
-  const buttonColumns = [
-    ...columns,
-    ButtonColumn("Edit", "primary", editCallback, "RosterStudentsTable"),
-    ButtonColumn("Delete", "danger", deleteCallback, "RosterStudentsTable"),
-  ];
+  const buttonColumns = [];
 
   return (
killedBy: RosterStudentsTable tests Edit button appears and navigates to edit page
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RosterStudentsTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
