[Survived] StringLiteral
main/components/Instructors/InstructorTable.js:13:18
 export default function InstructorTable({
   data,
   currentUser,
-  testIdPrefix = "InstructorTable",
+  testIdPrefix = "",
 }) {
   const deleteMutation = useBackendMutation(

[Survived] StringLiteral
main/components/Instructors/InstructorTable.js:18:6
   const deleteMutation = useBackendMutation(
     cellToAxiosParamsDelete,
     { onSuccess: onDeleteSuccess },
-    ["/api/instructors/all"]
+    [""]
   );
 

[Survived] ArrayDeclaration
main/components/Instructors/InstructorTable.js:18:5
   const deleteMutation = useBackendMutation(
     cellToAxiosParamsDelete,
     { onSuccess: onDeleteSuccess },
-    ["/api/instructors/all"]
+    []
   );
 
