[Killed] BlockStatement
main/pages/Instructors/InstructorsCreatePage.js:7:49
 import { toast } from "react-toastify";
 import { useNavigate } from "react-router-dom";
 
-export default function InstructorsCreatePage() {
-
-  const navigate = useNavigate();
-
-  const objectToAxiosParams = (instructor) => ({
-    url: "/api/instructors/post",
-    method: "POST",
-    params: { email: instructor.email },
-  });
-
-  const onSuccess = (instructor) => {
-    toast(`New Instructor Created: ${instructor.email}`);
-    navigate("/admin/instructors");
-  };
-
-  const mutation = useBackendMutation(objectToAxiosParams, { onSuccess });
-
-  return (
-    <div className="pt-3">
-      <h1>Create Instructor</h1>
-      <RoleEmailForm submitAction={mutation.mutate} buttonLabel="Create" />
-    </div>
-  );
-}
+export default function InstructorsCreatePage() {}
 
killedBy: InstructorsCreatePage submits and navigates
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RoleEmailForm-email"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrowFunction
main/pages/Instructors/InstructorsCreatePage.js:11:31
 
   const navigate = useNavigate();
 
-  const objectToAxiosParams = (instructor) => ({
-    url: "/api/instructors/post",
-    method: "POST",
-    params: { email: instructor.email },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (instructor) => {
killedBy: InstructorsCreatePage submits and navigates
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/pages/Instructors/InstructorsCreatePage.js:14:13
   const objectToAxiosParams = (instructor) => ({
     url: "/api/instructors/post",
     method: "POST",
-    params: { email: instructor.email },
+    params: {},
   });
 
killedBy: InstructorsCreatePage submits and navigates
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "email": "new@ucsb.edu",
- }

[Killed] BlockStatement
main/pages/Instructors/InstructorsCreatePage.js:17:37
     params: { email: instructor.email },
   });
 
-  const onSuccess = (instructor) => {
-    toast(`New Instructor Created: ${instructor.email}`);
-    navigate("/admin/instructors");
-  };
+  const onSuccess = (instructor) => {};
 
   const mutation = useBackendMutation(objectToAxiosParams, { onSuccess });
killedBy: InstructorsCreatePage submits and navigates
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/admin/instructors"

Number of calls: 0

Ignored nodes: comments, script, style
<html>
