[Survived] ArrayDeclaration
main/pages/Instructors/InstructorsIndexPage.js:14:9
 
   const { data: instructors, error: _error, status: _status } =
       useBackend(
-        ["/api/instructors/all"],
+        [],
         { method: "GET", url: "/api/instructors/all" },
         []

[Survived] StringLiteral
main/pages/Instructors/InstructorsIndexPage.js:14:10
 
   const { data: instructors, error: _error, status: _status } =
       useBackend(
-        ["/api/instructors/all"],
+        [""],
         { method: "GET", url: "/api/instructors/all" },
         []

[Killed] StringLiteral
main/pages/Instructors/InstructorsIndexPage.js:15:31
   const { data: instructors, error: _error, status: _status } =
       useBackend(
         ["/api/instructors/all"],
-        { method: "GET", url: "/api/instructors/all" },
+        { method: "GET", url: "" },
         []
       );
killedBy: InstructorsIndexPage renders table and New button
statusReason: Error: Unable to find an element with the text: jettkim@ucsb.edu. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="pt-3"
    >

[Killed] ObjectLiteral
main/pages/Instructors/InstructorsIndexPage.js:15:9
   const { data: instructors, error: _error, status: _status } =
       useBackend(
         ["/api/instructors/all"],
-        { method: "GET", url: "/api/instructors/all" },
+        {},
         []
       );
killedBy: InstructorsIndexPage renders table and New button
statusReason: Error: Unable to find an element with the text: jettkim@ucsb.edu. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="pt-3"
    >

[Killed] ArrowFunction
main/pages/Instructors/InstructorsIndexPage.js:20:5
       );
 
   const sorted = React.useMemo(
-    () => [...instructors].sort((a, b) => a.email.localeCompare(b.email)),
+    () => undefined,
     [instructors]
   );
killedBy: InstructorsIndexPage renders table and New button
statusReason: TypeError: Cannot read properties of undefined (reading 'forEach')

[Survived] ArrowFunction
main/pages/Instructors/InstructorsIndexPage.js:20:33
       );
 
   const sorted = React.useMemo(
-    () => [...instructors].sort((a, b) => a.email.localeCompare(b.email)),
+    () => [...instructors].sort(() => undefined),
     [instructors]
   );

[Survived] ArrowFunction
main/pages/Instructors/InstructorsIndexPage.js:31:18
       <h1 data-testid="InstructorsIndexPage-title">Instructors</h1>
       <Button
         variant="primary"
-        onClick={() => navigate("/admin/instructors/create")}
+        onClick={() => undefined}
         data-testid="InstructorsIndexPage-newInstructor"
       >

[Survived] StringLiteral
main/pages/Instructors/InstructorsIndexPage.js:31:33
       <h1 data-testid="InstructorsIndexPage-title">Instructors</h1>
       <Button
         variant="primary"
-        onClick={() => navigate("/admin/instructors/create")}
+        onClick={() => navigate("")}
         data-testid="InstructorsIndexPage-newInstructor"
       >
