[Killed] BlockStatement
src/main/utils/InstructorUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/instructors",
-    method: "DELETE",
-    params: {
-      email: cell.row.values.email,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: InstructorUtils cellToAxiosParamsDelete returns correct config
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "DELETE", "params": {"email": "jettkim@ucsb.edu"}, "url": "/api/instructors"}
Received: undefined
