[Killed] BlockStatement
main/components/RosterStudents/RosterStudentsTable.js:55:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/rosterstudents/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: RosterStudentsTable tests Edit button appears and navigates to edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/rosterstudents/edit/1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>
