[Killed] StringLiteral
main/components/Courses/CoursesTable.js:14:15
   },
   {
     Header: "Org Name",
-    accessor: "orgName",
+    accessor: "",
   },
   {
statusReason: TestingLibraryElementError: Unable to find an element with the text: wsu-cpts489-fa20. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:17:13
     accessor: "orgName",
   },
   {
-    Header: "Course Name",
+    Header: "",
     accessor: "courseName",
   },
statusReason: TestingLibraryElementError: Unable to find an element with the text: Course Name. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:18:15
   },
   {
     Header: "Course Name",
-    accessor: "courseName",
+    accessor: "",
   },
   {
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-courseName"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/Courses/CoursesTable.js:24:3
     Header: "Term",
     accessor: "term",
   },
-  {
-    Header: "School",
-    accessor: "school",
-  },
+  {},
 ];
 
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:26:15
   },
   {
     Header: "School",
-    accessor: "school",
+    accessor: "",
   },
 ];
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-school"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BooleanLiteral
main/components/Courses/CoursesTable.js:32:23
 
 export default function CoursesTable({
   courses,
-  showInstallButton = false,
+  showInstallButton = true,
   showRosterButton = false,
   storybook = false,
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-primary" data-testid="CoursesTable-cell-row-0-col-Install Github App-button" type="button">Install Github App</button> instead

[Killed] BooleanLiteral
main/components/Courses/CoursesTable.js:33:22
 export default function CoursesTable({
   courses,
   showInstallButton = false,
-  showRosterButton = false,
+  showRosterButton = true,
   storybook = false,
 }) {
killedBy: CoursesTable tests Tests that the default is to NOT show the buttons for roster students
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-primary" data-testid="CoursesTable-cell-row-0-col-Roster Students-button" type="button">Roster Students</button> instead

[Killed] BooleanLiteral
main/components/Courses/CoursesTable.js:34:15
   courses,
   showInstallButton = false,
   showRosterButton = false,
-  storybook = false,
+  storybook = true,
 }) {
   const installCallback = (cell) => {
killedBy: CoursesTable tests Calls the navigate callback when the install button is pressed
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "would have navigated to: /api/courses/redirect?courseId=1"

[Killed] BlockStatement
main/components/Courses/CoursesTable.js:36:37
   showRosterButton = false,
   storybook = false,
 }) {
-  const installCallback = (cell) => {
-    const url = `/api/courses/redirect?courseId=${cell.row.values.id}`;
-    if (storybook) {
-      window.alert(`would have navigated to: ${url}`);
-      return;
-    }
-    window.location.href = url;
-  };
+  const installCallback = (cell) => {};
 
   const rosterCallback = (cell) => {
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:37:17
   storybook = false,
 }) {
   const installCallback = (cell) => {
-    const url = `/api/courses/redirect?courseId=${cell.row.values.id}`;
+    const url = ``;
     if (storybook) {
       window.alert(`would have navigated to: ${url}`);
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/courses/redirect?courseId=1"
Received: ""

Number of calls: 1

[Killed] BlockStatement
main/components/Courses/CoursesTable.js:38:20
 }) {
   const installCallback = (cell) => {
     const url = `/api/courses/redirect?courseId=${cell.row.values.id}`;
-    if (storybook) {
-      window.alert(`would have navigated to: ${url}`);
-      return;
-    }
+    if (storybook) {}
     window.location.href = url;
   };
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.js:38:9
 }) {
   const installCallback = (cell) => {
     const url = `/api/courses/redirect?courseId=${cell.row.values.id}`;
-    if (storybook) {
+    if (true) {
       window.alert(`would have navigated to: ${url}`);
       return;
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
main/components/Courses/CoursesTable.js:45:36
     window.location.href = url;
   };
 
-  const rosterCallback = (cell) => {
-    const courseId = cell.row.values.id;
-    const url = `/admin/courses/${courseId}/roster_students`;
-    if (storybook) {
-      window.alert(`would have navigated to: ${url}`);
-      return;
-    }
-    window.location.href = url;
-  };
+  const rosterCallback = (cell) => {};
 
   const installColumns = [
killedBy: CoursesTable tests Calls window.alert when the roster students button is pressed on storybook
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.js:48:9
   const rosterCallback = (cell) => {
     const courseId = cell.row.values.id;
     const url = `/admin/courses/${courseId}/roster_students`;
-    if (storybook) {
+    if (true) {
       window.alert(`would have navigated to: ${url}`);
       return;
killedBy: CoursesTable tests Calls the navigate callback when the roster students button is pressed
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "would have navigated to: /admin/courses/1/roster_students"

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.js:48:9
   const rosterCallback = (cell) => {
     const courseId = cell.row.values.id;
     const url = `/admin/courses/${courseId}/roster_students`;
-    if (storybook) {
+    if (false) {
       window.alert(`would have navigated to: ${url}`);
       return;
killedBy: CoursesTable tests Calls window.alert when the roster students button is pressed on storybook
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:49:20
     const courseId = cell.row.values.id;
     const url = `/admin/courses/${courseId}/roster_students`;
     if (storybook) {
-      window.alert(`would have navigated to: ${url}`);
+      window.alert(``);
       return;
     }
killedBy: CoursesTable tests Calls window.alert when the roster students button is pressed on storybook
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "would have navigated to: /admin/courses/1/roster_students"
Received: ""

Number of calls: 1

[Killed] ArrayDeclaration
main/components/Courses/CoursesTable.js:55:26
     window.location.href = url;
   };
 
-  const installColumns = [
-    ButtonColumn(
-      "Install Github App",
-      "primary",
-      installCallback,
-      "CoursesTable",
-    ),
-  ];
+  const installColumns = [];
 
   const rosterColumns = [
killedBy: CoursesTable tests Calls the navigate callback when the install button is pressed
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-Install Github App-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:65:18
   ];
 
   const rosterColumns = [
-    ButtonColumn("Roster Students", "primary", rosterCallback, "CoursesTable"),
+    ButtonColumn("", "primary", rosterCallback, "CoursesTable"),
   ];
 
killedBy: CoursesTable tests Calls the navigate callback when the install button is pressed
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:65:64
   ];
 
   const rosterColumns = [
-    ButtonColumn("Roster Students", "primary", rosterCallback, "CoursesTable"),
+    ButtonColumn("Roster Students", "primary", rosterCallback, ""),
   ];
 
killedBy: CoursesTable tests Calls the navigate callback when the roster students button is pressed
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-Roster Students-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.js:70:7
 
   let columnsToDisplay = [...columns];
 
-  if (showInstallButton) columnsToDisplay.push(...installColumns);
+  if (true) columnsToDisplay.push(...installColumns);
 
   if (showRosterButton) columnsToDisplay.push(...rosterColumns);
killedBy: CoursesTable tests Tests that the default is to NOT show the buttons for installation
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-primary" data-testid="CoursesTable-cell-row-0-col-Install Github App-button" type="button">Install Github App</button> instead

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.js:70:7
 
   let columnsToDisplay = [...columns];
 
-  if (showInstallButton) columnsToDisplay.push(...installColumns);
+  if (false) columnsToDisplay.push(...installColumns);
 
   if (showRosterButton) columnsToDisplay.push(...rosterColumns);
killedBy: CoursesTable tests Calls the navigate callback when the install button is pressed
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-Install Github App-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.js:72:7
 
   if (showInstallButton) columnsToDisplay.push(...installColumns);
 
-  if (showRosterButton) columnsToDisplay.push(...rosterColumns);
+  if (true) columnsToDisplay.push(...rosterColumns);
 
   return (
killedBy: CoursesTable tests Tests that the default is to NOT show the buttons for roster students
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-primary" data-testid="CoursesTable-cell-row-0-col-Roster Students-button" type="button">Roster Students</button> instead

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.js:72:7
 
   if (showInstallButton) columnsToDisplay.push(...installColumns);
 
-  if (showRosterButton) columnsToDisplay.push(...rosterColumns);
+  if (false) columnsToDisplay.push(...rosterColumns);
 
   return (
killedBy: CoursesTable tests Calls the navigate callback when the roster students button is pressed
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-Roster Students-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
