[Killed] BlockStatement
main/components/Nav/Footer.js:3:34
 import { Container } from "react-bootstrap";
 
-export default function Footer() {
-  return (
-    <footer className="bg-light pt-3 pt-md-4 pb-4 pb-md-5" data-testid="Footer">
-      <Container>
-        <p>
-          This is the MVP for the Frontiers project. See the repo on{" "}
-          <a href="https://github.com/ucsb-cs156/proj-frontiers">Github.</a>
-        </p>
-      </Container>
-    </footer>
-  );
-}
+export default function Footer() {}
 
killedBy: Footer tests renders correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="Footer"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] StringLiteral
main/components/Nav/Footer.js:8:70
     <footer className="bg-light pt-3 pt-md-4 pb-4 pb-md-5" data-testid="Footer">
       <Container>
         <p>
-          This is the MVP for the Frontiers project. See the repo on{" "}
+          This is the MVP for the Frontiers project. See the repo on{""}
           <a href="https://github.com/ucsb-cs156/proj-frontiers">Github.</a>
         </p>
killedBy: Footer tests renders correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "This is the MVP for the Frontiers project. See the repo on Github."
Received: "This is the MVP for the Frontiers project. See the repo onGithub."
