[Killed] StringLiteral
main/components/RosterStudents/RosterStudentsForm.js:23:24
   // Stryker disable next-line Regex
   const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
 
-  const testIdPrefix = "RosterStudentsForm";
+  const testIdPrefix = "";
 
   return (
killedBy: RosterStudentsForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="RosterStudentsForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/RosterStudents/RosterStudentsForm.js:48:37
           id="studentId"
           type="text"
           isInvalid={Boolean(errors.studentId)}
-          {...register("studentId", {
-            required: "Student Id is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
-          })}
+          {...register("studentId", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: RosterStudentsForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Student Id is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/RosterStudents/RosterStudentsForm.js:57:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.studentId?.message}
+          {errors.studentId.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RosterStudentsForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/RosterStudents/RosterStudentsForm.js:68:24
           id="firstName"
           type="text"
           isInvalid={Boolean(errors.firstName)}
-          {...register("firstName", {
+          {...register("", {
             required: "First Name is required.",
           })}
killedBy: RosterStudentsForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/RosterStudents/RosterStudentsForm.js:69:23
           type="text"
           isInvalid={Boolean(errors.firstName)}
           {...register("firstName", {
-            required: "First Name is required.",
+            required: "",
           })}
         />
killedBy: RosterStudentsForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /First Name is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/RosterStudents/RosterStudentsForm.js:73:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.firstName?.message}
+          {errors.firstName.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RosterStudentsForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/RosterStudents/RosterStudentsForm.js:84:24
           id="lastName"
           type="text"
           isInvalid={Boolean(errors.lastName)}
-          {...register("lastName", {
+          {...register("", {
             required: "Last Name is required.",
           })}
killedBy: RosterStudentsForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/RosterStudents/RosterStudentsForm.js:89:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.lastName?.message}
+          {errors.lastName.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RosterStudentsForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/RosterStudents/RosterStudentsForm.js:104:24
             required: "Email is required.",
             pattern: {
               value: emailRegex,
-              message: "Email is not valid.",
+              message: "",
             },
           })}
killedBy: RosterStudentsForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Email is not valid/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
