[Killed] ObjectLiteral
main/components/RosterStudents/RosterStudentsTable.js:15:3
     Header: "id",
     accessor: "id", // accessor is the "key" in the data
   },
-  {
-    Header: "Student ID",
-    accessor: "studentId",
-  },
+  {},
   {
     Header: "First Name",
killedBy: RosterStudentsTable tests Has the expected column headers and content
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RosterStudents/RosterStudentsTable.js:24:13
     accessor: "firstName",
   },
   {
-    Header: "Last Name",
+    Header: "",
     accessor: "lastName",
   },
killedBy: RosterStudentsTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Last Name. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RosterStudents/RosterStudentsTable.js:40:13
     accessor: "orgStatus",
   },
   {
-    Header: "Github ID",
+    Header: "",
     accessor: "githubId",
   },
killedBy: RosterStudentsTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Github ID. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/RosterStudents/RosterStudentsTable.js:43:3
     Header: "Github ID",
     accessor: "githubId",
   },
-  {
-    Header: "Github Username",
-    accessor: "githubLogin",
-  },
+  {},
 ];
 
killedBy: RosterStudentsTable tests Has the expected column headers and content
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RosterStudents/RosterStudentsTable.js:45:15
   },
   {
     Header: "Github Username",
-    accessor: "githubLogin",
+    accessor: "",
   },
 ];
killedBy: RosterStudentsTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RosterStudentsTable-cell-row-0-col-githubLogin"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BooleanLiteral
main/components/RosterStudents/RosterStudentsTable.js:51:17
 
 export default function RosterStudentsTable({
   rosterStudents,
-  showButtons = false,
+  showButtons = true,
 }) {
   const navigate = useNavigate();
killedBy: RosterStudentsTable tests Does NOT show buttons by default
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-primary" data-testid="RosterStudentsTable-cell-row-0-col-Edit-button" type="button">Edit</button> instead

[Killed] BlockStatement
main/components/RosterStudents/RosterStudentsTable.js:55:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   const { courseId } = useParams();
killedBy: RosterStudentsTable tests Edit button appears and navigates to edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "edit/1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
main/components/RosterStudents/RosterStudentsTable.js:76:51
 
   const buttonColumns = [
     ...columns,
-    ButtonColumn("Edit", "primary", editCallback, "RosterStudentsTable"),
+    ButtonColumn("Edit", "primary", editCallback, ""),
     ButtonColumn("Delete", "danger", deleteCallback, "RosterStudentsTable"),
   ];
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RosterStudentsTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
