[Killed] ObjectLiteral
main/components/Users/RoleEmailForm.js:37:33
           id="email"
           type="email"
           isInvalid={Boolean(errors.email)}
-          {...register("email", {
-            required: "Email is required.",
-            pattern: emailRegex,
-          })}
+          {...register("email", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: RoleEmailForm tests that the correct validations are performed
statusReason: TypeError: e is not a function
