[Killed] BlockStatement
main/components/Users/RoleEmailTable.js:36:43
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
   return <OurTable data={roleemails} columns={columns} testid={testIdPrefix} />;
 }
killedBy: RoleEmailTable tests Has the expected column headers and content for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RoleEmailTable-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
