[Killed] StringLiteral
main/pages/Courses/CoursesIndexPage.js:18:15
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/courses/all"],
-    { method: "GET", url: "/api/courses/all" },
+    { method: "", url: "/api/courses/all" },
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: CoursesIndexPage tests renders empty table when backend unavailable, admin only
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/courses/all"
Received string:    "Error communicating with backend via  on /api/courses/all"

[Killed] StringLiteral
main/pages/Courses/CoursesIndexPage.js:29:51
         <h1>Courses</h1>
         <CoursesTable
           courses={courses}
-          showInstallButton={hasRole(currentUser, "ROLE_ADMIN")}
+          showInstallButton={hasRole(currentUser, "")}
           showRosterButton={hasRole(currentUser, "ROLE_ADMIN")}
         />
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-Install Github App-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
