[Killed] BlockStatement
src/main/utils/RoleEmailUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/roleemails",
-    method: "DELETE",
-    params: {
-      id: cell.row.values.email,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: RoleEmailTable tests Delete button calls delete callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
src/main/utils/RoleEmailUtils.js:10:10
 
 export function cellToAxiosParamsDelete(cell) {
   return {
-    url: "/api/roleemails",
+    url: "",
     method: "DELETE",
     params: {
killedBy: helpRequestUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "method": "DELETE",
    "params": Object {

[Killed] ObjectLiteral
src/main/utils/RoleEmailUtils.js:12:13
   return {
     url: "/api/roleemails",
     method: "DELETE",
-    params: {
-      id: cell.row.values.email,
-    },
+    params: {},
   };
 }
killedBy: RoleEmailTable tests Delete button calls delete callback
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "id": "joegaucho@ucsb.edu",
- }
